Revit 2027 API
Rebar.FreeFormSurfaceServerGuid Property
 Guid used for identifying the external IRebarUpdateServer for computing Surface Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid FreeFormSurfaceServerGuid { get; }
Public Shared ReadOnly Property FreeFormSurfaceServerGuid As Guid
	Get
public:
static property Guid FreeFormSurfaceServerGuid {
	Guid get ();
}
static member FreeFormSurfaceServerGuid : Guid with get
Property Value
Guid
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace